// module ZJNGEx {
//     (function () {
//         NG.Utils.importCurContent(this.ZJNGEx, "16人扩展", NG.ImportFumType.run,

//             function (lib: Lib, game: Game, ui: UI, get: Get, ai: AI, _status: Status) {

//                 //添加扩展：
//                 // lib.config.all.stockextension.push("十六人扩展精简版");
//                 // lib.config.all.plays.push("十六人扩展精简版");
//                 // lib.translate[i+'_card_config']=pack.card[i];
//                 lib.extensionMenu["extension_十六人扩展精简版"] = {
//                     "jmsfaa": { 
//                         "name": "缩放", 
//                         "init": true,
//                          "intro": "开启后，人数大于12时缩小武将牌。8人局以上，任何卡牌不能指定距离大于四的角色为目标。" 
//                     }, 
//                     "IncreasePlayer5Number": { 
//                         "name": "增加人数", 
//                         "init": "all", 
//                         "item": { 
//                             "0": "不增加", 
//                             "1": "+1", 
//                             "2": "+2", 
//                             "3": "+3", 
//                             "4": "+4", 
//                             "5": "+5", 
//                             "6": "+6", 
//                             "7": "+7", 
//                             "8": "+8", 
//                             "all": "全部增加" 
//                         } 
//                     }, 
//                     "nine9Man": { 
//                         "name": "九人场身份", 
//                         "init": "1", 
//                         "item": { 
//                             "1": "三忠四反一内", 
//                             "2": "二忠四反二内", 
//                             "3": "四忠四反零内", 
//                             "4": "三忠五反零内" 
//                         } 
//                     }, 
//                     "ten10Man": { 
//                         "name": "十人场身份", 
//                         "init": "1", 
//                         "item": { 
//                             "1": "三忠四反二内", 
//                             "2": "三忠五反一内", 
//                             "3": "四忠五反零内" 
//                         } 
//                     }, 
//                     "eleven11Man": { 
//                         "name": "十一人场身份", 
//                         "init": "1", 
//                         "item": { 
//                             "1": "四忠五反一内", 
//                             "2": "三忠五反二内", 
//                             "3": "五忠五反零内", 
//                             "4": "四忠六反零内" 
//                         } 
//                     }, 
//                     "twelve12Man": { 
//                         "name": "十二人场身份", 
//                         "init": "1", 
//                         "item": { 
//                             "1": "四忠五反二内", 
//                             "2": "四忠六反一内", 
//                             "3": "五忠六反零内" 
//                         } 
//                     }, 
//                     "thirteen13Man": { 
//                         "name": "十三人场身份", 
//                         "init": "1", 
//                         "item": { 
//                             "1": "五忠六反一内", 
//                             "2": "四忠六反二内", 
//                             "3": "六忠六反零内", 
//                             "4": "五忠七反零内" 
//                         } 
//                     }, 
//                     "fourteen14Man": { 
//                         "name": "十四人场身份", 
//                         "init": "1", 
//                         "item": { 
//                             "1": "五忠六反二内", 
//                             "2": "五忠七反一内", 
//                             "3": "六忠七反零内" 
//                         } 
//                     }, 
//                     "fifteen15Man": { 
//                         "name": "十五人场身份", 
//                         "init": "1", 
//                         "item": { 
//                             "1": "六忠七反一内", 
//                             "2": "五忠七反二内", 
//                             "3": "七忠七反零内", 
//                             "4": "六忠八反零内" 
//                         } 
//                     }, 
//                     "Sixteen16Man": { 
//                         "name": "十六人场身份", 
//                         "init": "1", 
//                         "item": { 
//                             "1": "六忠七反二内", 
//                             "2": "六忠八反一内", 
//                             "3": "七忠八反零内" 
//                         } 
//                     } 
//                 }

//                 return null;
//             });
//     })();
// }